{
  "1": {
    "id": 1,
    "Name": "Elly|De La Cruz",
    "Organization": "Cincinnati Reds",
    "articles": [
      {
        "title": "Our Mission â\u0080\u0093 How News Works",
        "article": "Trustworthy and timely information empowers you to better understand your world and make educated decisions. Google aims to make it easier to stay informed by using technology to organize and help people access information about current issues and events. News experiences across Google are built to help you easily find news from a diversity of trusted sources so you can stay up-to-date and informed on the stories that matter most to you.\nWeâre committed to fostering a healthy and diverse news ecosystem because we know staying informed through access to quality, original reporting is vital to strong, functioning societies.",
        "date": null,
        "URL": "https://newsinitiative.withgoogle.com/hownewsworks/?fg=1"
      },
      {
        "title": "The Enquirer Subscription Offers, Specials, and Discounts",
        "article": "Get unlimited access with a subscription\nEssential Digital\n$1 per month for 12 months\nSubscribe Now\nWhat's included\nUnlimited access to and our apps.\nThe eNewspaper: a digital replica of the newspaper.\nAdd a user to your digital subscription for free.\nSunday Plus\n$1 for 1 month\nSubscribe Now\nWhat's included\nAll the features of Essential Digital\nSunday print delivery of\nUSA TODAY Crossword\nNo commitment required. Cancel anytime.\n*Offer available to new customers only. All savings based off the regular rate.\nRead the full Subscription Terms and Conditions.\n© 2024 www.cincinnati.com",
        "date": "2024-08-05",
        "URL": "https://www.cincinnati.com/story/sports/mlb/reds/2024/08/05/cincinnati-reds-florida-marlins-elly-de-la-cruz-record/74682432007/"
      },
      {
        "title": "Elly De La Cruz leads Cincinnati Reds past Miami Marlins",
        "article": "Elly De La Cruz put on a personal Demolition Derby on Monday night in Miami’s loanDepot Park and he wasn’t even driving a car.\nTwo home runs, two doubles, three RBI, three runs scored. What? No stolen base? It was his explosive response to his 0 for 14 when the game began.\nDe La Cruz was the hub cap of a big wheel 15-hit attack, eight for extra bases, that added up to a 10-3 Cincinnati Reds victory over the Miami Marlins.\nAnd De La Cruz continues to etch his name all over the Reds’ record books. He is only the second Reds player since 1901 to have two doubles and two home runs in a game. Paul O’Neill did it in 1991 against the Chicago Cubs in Wrigley Field.\nI got two words for ya: Elly De La Cruz. Must-see TV. pic.twitter.com/QCcFjDTtwC\n— Cincinnati Reds (@Reds) August 5, 2024\nHis offensive legend continues in his first full MLB season — 20 homers, 57 RBI, a four extra-base hits game and the flashiest oven mitts in the game.\nNot even a broad smile reveals what kind of night De La Cruz has because he goes through life with a perma-press smile.\nAsked why playing Miami brings out his best (9-16, four homers, three doubles), De La Cruz smiled even wider and told Bally Sports Ohio, “As I always say, it doesn’t matter what team I play against, I’m gonna play hard.”\nTry telling that to Miami.\nAnd about hitting two home runs and not stealing a base, even though he likes stealing bases best of all, he said, “That felt great ... amazing, amazing.”\nAdd a couple more amazings to that one.\nBy the way, those weren’t the Miami Marlins the Reds crushed. They are the Miami Minnows.\nThe franchise traded nine players at the deadline — its top three run producers, three of its top four home run hitters and its closer.\nNevertheless, Miami was 9-7 since the All-Star break and just split four games against the Atlanta Braves.\nBut the Reds continued turning loose big sticks, crashing four more home runs, nine in their last three games.\nAnd in four games, three wins, the Reds have scored 30 runs. They are beating up on baseball’s have-nots — 12-2 this season against Miami, Colorado and the Chicago White Sox.\nDe La Cruz, Noelvi Marte and Ty France homered to give the Reds a 7-0 lead in five innings as Reds starter Nick Martinez pitched five scoreless four-hit innings.\nMiami, though, had one big moment.\nJesus Sanchez, the highest paid Miami player at $2.1 million, hit the longest home run in MLB this season.\nHe was the first batter relief pitcher Jakob Junis faced in the sixth inning and Sanchez planted it high into the upper deck, 480 feet from home plate. It was three feet farther than the 477 footer Jorge Solar hit earlier this season.\nAnd Junis gave up three straight singles to open the seventh. One run scored on a double play and another scored on a single by Jonah Bride, cutting Cincinnati’s lead to 7-3.\nThat ended the night for Junis. Buck Farmer replaced him and gave up a quick single, but retired Emmanuel Rivera on a ground ball.\nAt that point, Miami had outhit the Reds, 11-10, but stranded nine runners in seven innings.\nMiami starter Roddery Munoz lasted only 3 2/3 innings, the shortest start of his short career and probably wished his identical twin brother, Rolddy Munoz, had started the game.\nBut Rolddy is pitching in the Atlanta Braves minor league system.\nJonathan India opened the game with an infield hit and De La Cruz picked on the first pitch and lined it so fast into seats that right fielder Sanchez didn’t budge and it was 2-0.\nIndia singled with one out in the third. De La Cruz grounded to the mound and Munoz threw wild to first base. Second baseman Otto Lopez picked it up and threw it into center and India scored from first on the double error. De La Cruz end up on third and scored on TJ Friedl’s sacrifice fly and it was 4-0.\nIt became 6-0 in the fourth when Jake Fraley beat out an infield hit and Marte launched a two-run home run.\nThe lead expanded to 7-0 in fifth. France, 1 for 14 since arriving from Seattle via trade, ripped his first home run.\nAfter Miami made its little run, De La Cruz struck again, a 428-foot home run into the right field upper deck for an 8-3 lead.\nIt was Deuces Wild for the Reds as they scored two runs in the first, third, fourth, eighth and ninth.\nThe two in the ninth came on a two-run double by Jake Fraley after singles by TJ Friedl and France, who followed his home run with a double and a single for a three-hit night.\nAbout the Author",
        "date": "2024-08-06",
        "URL": "https://www.daytondailynews.com/sports/mccoy-more-history-for-elly-de-la-cruz-as-reds-mash-marlins/Z3HZH76XINCQJKGNX7M43CHEBM/"
      },
      {
        "title": "Elly De La Cruz records four extra-base hits in Reds’ win",
        "article": "De La Cruz reaches 20/50 mark with massive four-XBH night\nMIAMI -- Elly De La Cruz is no stranger to history. He’s already had some impressive outings in his young career, but on Monday night in Miami, De La Cruz joined two other Cincinnati greats on an exclusive list.\nWith a pair of home runs in the Reds’ 10-3 win over the Marlins at loanDepot park, De La Cruz became the third Red to hit 20 home runs and steal 50 bases in a single season, joining Joe Morgan (1973, ‘74, ‘76) and Eric Davis (‘86, ‘87). De La Cruz is the 14th player in AL/NL history (since 1901) to have a 20/50 season.\nDe La Cruz and Davis are fairly close; the 22-year-old shortstop will often receive a text from Davis after a game, asking how he felt about his performance and whatnot. Now, the pair share company on the same elite list -- a list synonymous with power and speed.\nDe La Cruz said \"it means a lot\" to have the support of Davis, and also another former Reds great who texts with him, Barry Larkin. \"I feel so grateful to be here and to feel so very supported.”\nThe two home runs were just part of De La Cruz’s performance on Monday, as he went 4-for-5 with the two long balls and two doubles to record his first game with four extra-base hits. De La Cruz became just the second Reds player (since at least 1901) to have two doubles and two home runs in a single game. The other player? Paul O’Neill, who accomplished the feat on May 11, 1991 -- 10 years and eight months before De La Cruz was born.\n“It's really special to watch,” starting pitcher Nick Martinez said. “[Brent] Suter did the math in the dugout, I think [De La Cruz] had a total exit velocity of like 490-something today? He was absolutely crushing the ball.”\nCincinnati’s onslaught began when De La Cruz crushed a two-run homer in the first inning to set the tone. In his next at-bat, De La Cruz jetted around the bases, taking advantage of a pair of errors from the Marlins to turn a measly grounder (which went just four feet) into three bases. He then doubled in the fourth and sixth innings before crushing a solo homer -- his 20th of the season -- in the eighth inning.\nDe La Cruz entered the series after going 0-for-11 against the Giants over the weekend. He was one of a few Reds who has had a small downtick in production of late. But that’s no issue for the youngster, nor the club as a whole. De La Cruz was one of three Reds who went yard against the Marlins, joining Ty France and Noelvi Marte.\n“He just keeps getting better,” manager David Bell said. “Loves to play. He had a good game the last game on the last road trip, [and] I gave him an off-day the next day -- I think it got him out of his rhythm a little bit and he just kept fighting to find his timing and rhythm.\n“We knew he'd get it back, and today everything kind of came together for him. So I think the idea now is to hold on to that, [and] we should be able to do that. He just works so hard and plays hard every single day and clearly helped us win the game tonight.”\nNow, circling back to that 20/50 mark; De La Cruz is just the third player to achieve the feat in their age 22 season -- the D-backs’ Corbin Carroll did so last season -- and is the youngest primary shortstop (at least 50% of games at the position) to reach the mark. Hanley Ramirez, who went 29/51 in 2007, is the only other shortstop to do so, and that was his age 23 season.\nSo will his manager ever get tired of seeing De La Cruz continue to make history?\n“No, of course not,” Bell said with a laugh. “There's a lot more to come.\n“... It's fun to watch him every day. But it does start with his approach to how he's working and continuing to get better, [he] wants to be on the field. And he’s a great teammate. Teammates love him -- that makes it more enjoyable to watch him play. not only is he a great player, but he's doing all the other things.”",
        "date": "2024-08-06",
        "URL": "https://www.mlb.com/news/elly-de-la-cruz-records-four-extra-base-hits-in-reds-win"
      },
      {
        "title": "Elly De La Cruz homers twice in the Reds 10-3 win - Redleg Nation",
        "article": "Elly De La Cruz is a superstar. And in his own words, he’s the most exciting player in baseball – as he told Jeff Passan. At least on Monday night he backed that up as he had four extra-base hits that included two home runs as the Cincinnati Reds crushed the Miami Marlins 10-3 to open up their 4-game series down in Florida.\nCincinnati wasted next to no time in taking the lead on Monday night. Jonathan India led off the game with a single and then got to trot home when Elly De La Cruz hit a laser over the Reds bullpen for a 2-run homer. Two innings later they would pad that lead after another single by India and then De La Cruz forcing a throwing error that led to a second throwing error and brought India around to score. TJ Friedl capped the inning with a sacrifice fly as Cincinnati built a 4-0 lead.\nNick Martinez, who was starting on short rest after making a relief appearance last series, cruised through the Marlins lineup. He was about as pitch efficient as possible and his offense just kept playing add on for him. In the top of the 4th inning Noelvi Marte made it 6-0 with an opposite field 2-run homer. An inning later it was Ty France coming through with a solo shot that extended the lead to 7-0.\nMartinez would return to the mound for the 5th and he had to work around a single, but he did just that to complete his night and exit the game with his team up by a touchdown. Jakob Junis took over in the 6th and gave up a 480-foot moonshot to Jesus Sanchez as the Marlins got on the board to cut the lead to six runs.\nMiami took it to Jakob Junis again in the 7th inning. They put together three straight singles to load the bases. Junis got a grounder up the middle that saw Elly De La Cruz make a sliding stop on after a weird hop off of the mound and turn it into a double play, but brought in a Marlins run. A 4th single in the inning followed and brought in another run as the Reds lead was cut to 7-3. That was it for Junis as Cincinnati turned the game over to Buck Farmer with two outs. He’d give up another single, but get out of the inning with no further damage.\nIn the top of the 8th inning the Reds got one of those runs back. Elly De La Cruz unloaded on an 0-1 pitch from Shaun Anderson, hitting it 428 feet into the seats for his second homer of the day and his 4th extra-base hit of the game.\nThe Reds played add on in the top of the 9th. After loading the bases, Jake Fraley doubled down the left field line to plate two runs and make it 10-3. Justin Wilson came into the game for the final three outs and held that score as the visiting team grabbed the first game of the series with a blowout win.\nKey Moment of the Game\nNoelvi Marte’s 2-run home run in the 4th inning. That put the game out of slam range and it did so early on.\nNotes Worth Noting\nElly De La Cruz had four hits and 12 total bases. He raised his OPS 37 points in this game. He also hasn’t struck out in the last three games.\nTy France had three hits, including a double and a homer.\nNick Martinez, who has struggled in the role as a starter this season, threw five shutout innings with five strikeouts as he lowered his ERA on the season to 3.43.\nThe Reds had 15 hits on the night, walking three times and striking out just four times.\nUp Next for the Cincinnati Reds\nCincinnati Reds vs Miami Marlins\nTuesday August 6th, 6:40pm ET\nNick Lodolo (8-4, 3.99 ERA) vs Max Meyer (2-1, 3.81 ERA)",
        "date": "2024-08-05",
        "URL": "https://www.redlegnation.com/2024/08/05/elly-de-la-cruz-homers-twice-cincinnati-reds-10-3-win/"
      },
      {
        "title": "Elly De La Cruz collects his second home run of the game for the Reds, this one a solo blast to right field | FOX Sports",
        "article": "my favs\nAccess and manage your favorites here\nDISMISS\nScores\nWatch\nOdds\nStories\nPodcasts\nNewsletter\nSearch\nSign In\nAccount\nSPORTS & TEAMS\nPLAYERS\nSHOWS\nPERSONALITIES\nSPORTS\nSPORTS & TEAMS\nPLAYERS\nSHOWS\nPERSONALITIES\nSPORTS\nNFL\nNCAA FB\nMLB\nNBA\nNCAA BK\nNASCAR\nSoccer\nUFL\nNCAAW BK\nNHL\nGolf\nPremier Boxing Champions\nWWE\nUFC\nWNBA\nTennis\nMotor Sports\nProfessional Bowlers Association\nHorse Racing\nWestminster Kennel Club\nFIBA\nOlympics\nWorld Baseball Classic\nNRL\nThe Basketball Tournament\nMajor League Baseball\nshare\nfacebook\nx\nreddit\nlink\nElly De La Cruz collects his second home run of the game for the Reds, this one a solo blast to right field\nVideo Details\nElly De La Cruz collected his second home run of the game for the Cincinnati Reds, this one a solo blast to right field.\n13 HOURS AGO・Major League Baseball・0:16\nMajor League Baseball\nElly De La Cruz\nCincinnati Reds\nMLB - Cincinnati Reds vs. Miami Marlins - 08/05/2024\nMAJOR LEAGUE BASEBALL\nTrending\nMLB\nNASCAR\nNFL\nNCAAFB\nNBA\nMLS\nWNBA\nOlympics\nEPL\nPGA\n0:30\nUP NEXT\nDodgers Shohei Ohtani launches his 34th home run, a solo shot that extends lead vs. Phillies\n0:26\nJosh Smith hits his first career walkoff home run to secure a 4-3 win for the Rangers over the Astros\n0:15\nDodgers' Teoscar Hernández smashes a go-ahead, two-run home run against Phillies\n0:49\nTwins vs. Cubs Highlights | MLB on FOX\n0:25\nRangers' Corey Seager hits a solo home run to tie the game vs. Astros\n1:27\nDiamondbacks vs. Guardians Highlights | MLB on FOX\n1:11\nReds vs. Marlins Highlights | MLB on FOX\n1:00\nGiants vs. Nationals Highlights | MLB on FOX\n1:08\nMets vs. Cardinals highlights | MLB on FOX\n0:32\nDiamondbacks' Joc Pederson hits a GO-AHEAD, two-run home run against Guardians\nTop Leagues\nNFL\nCollege Football\nNBA\nMLB\nCollege Basketball\nUFL\nTop Shows\nUndisputed\nThe Herd with Colin Cowherd\nFirst Things First\nFlippin' Bats with Ben Verlander\nThe Skip Bayless Show\nThe Carton Show\nAffiliated Apps\nFOX Sports\nQuick Links\nSoccer Leagues and Tournaments\n2024 Summer Olympics\n2024 NFL Preseason Schedule\n2024 MLB Playoff Picture\nFOX SPORTS™, SPEED™, SPEED.COM™ & © 2024 Fox Media LLC and Fox Sports Interactive Media, LLC. All rights reserved. Use of this website (including any and all parts and components) constitutes your acceptance of these\nUpdated Terms of Use and\nPrivacy Policy |\nAdvertising Choices |\nYour Privacy Choices |\nClosed Captioning\nHelp\nPress\nAdvertise with Us\nJobs\nFOX Cincy\nRSS\nSitemap\nFS1\nFOX\nFOX News\nFox Corporation\nFOX Sports Supports\nFOX Deportes",
        "date": "2024-08-05",
        "URL": "https://www.foxsports.com/watch/fmc-2i373bdr3mxcmsuk"
      },
      {
        "title": "Elly De La Cruz Fills Up the History Books in Cincinnati Reds Win on Monday  ",
        "article": "Elly De La Cruz Fills Up the History Books in Cincinnati Reds Win on Monday\nThe Cincinnati Reds dismantled the Miami Marlins on Monday night, 10-3, at loanDepot park in Miami.\nWith the win, the Reds are now 54-58 on the season. The loss drops the Marlins to 42-71. Unfortunately, the Reds are one of the most disappointing teams in baseball. With a young core of exciting infielders, the Reds went out and added to their bullpen and rotation this offseason, plus they signed Jeimer Candelario.\nBut the season has gone off the rails due to an all-season injury to Matt McLain, a PED suspension for Noelvi Marte and what was a slow start to the year for Candelario.\nWhat hasn't been disappointing is the play of superstar infielder Elly De La Cruz, who was named to his first All-Star team this summer. In the win on Monday, he went 4-for-5 with three runs scored, three RBI, two doubles, and two homers.\nThat stat line helped him fill up the history books in multiple ways. First, according to Sarah Langs of MLB.com:\nat 22 years & 207 days old, Elly De La Cruz is the 6th-youngest player with 2+ 2B & 2+ HR in a game since at least 1901, older than only:\n7/1/03 Miguel Cabrera: 20y, 74d\n6/19/29 Mel Ott: 20y, 109d\n6/24/36 Joe DiMaggio: 21y, 212d\n9/7/89 Gregg Jefferies: 22y, 37d\n5/26/28 Freddie Lindstrom: 22y, 187d\nAnd this one, also from Langs:\nElly De La Cruz with the 20th 4-XBH game by a Reds player since at least 1901\nat 22 years & 207 days old, heâs the youngest Reds player to do it in that span\nDe La Cruz is now hitting .261 this season with 20 homers, 48 RBI and 57 stolen bases. He has posted an .843 OPS.\nThe Reds will play the Marlins again on Tuesday.\nFollow Fastball on FanNation on social media\nContinue to follow our Fastball on FanNation coverage on social media by liking us onÂ FacebookÂ and by following us on TwitterÂ @FastballFN.",
        "date": "2024-08-06",
        "URL": "https://www.si.com/fannation/mlb/fastball/history/elly-de-la-cruz-fills-up-the-history-books-in-cincinnati-reds-win-on-monday-over-miami-marlins"
      },
      {
        "title": "Reds 10-3 Marlins (Aug 5, 2024) Game Recap - ESPN",
        "article": "De La Cruz's 4 extra-base hits help Reds overcome Sánchez’s 480-foot homer to beat Marlins 10-3\nNoelvi Marte's HR just clears robbery attempt\nThe Marlins broadcast team thinks Jesus Sanchez robs a home run, but Noelvi Marte's two-run shot goes just over his glove.\nMIAMI -- — Elly De La Cruz became the youngest Cincinnati player with four extra-base hits in a game since at least 1901 and the Reds overcame Jesús Sánchez’s 480-foot home run, the longest in the major league this season, in a 10-3 win over the Miami Marlins on Monday night.\nNick Martinez (6-5) pitched five scoreless innings to win on his 34th birthday in his first start since May 22.\nDe La Cruz entered in an 0-for-13 slide and put Cincinnati ahead with a two-run homer off Roddery Muñoz (2-6) in the first inning. He doubled in the fourth and sixth innings and hit a solo homer in the eighth against Shaun Anderson, his 20th home run this season. De La Cruz has three multihomer games, including two this season.\n“Very appreciative of everything because the hard work is paying off,” De La Cruz said in Spanish. “Also appreciate my teammates and the support they give me.\"\nIt was the 20th four-extra-base hit game by a Reds player since 1901 and at 22 years, 207 days De La Cruz became the youngest Cincinnati player to accomplish the feat since then. He is the sixth-youngest overall, according to MLB, trailing only Miguel Cabrera (20 years, 74 days in 2003), Mel Ott (20-109 in 1929), Joe DiMaggio (21-212 in 1936), Gregg Jefferies (22-37 in 1989) and Freddie Lindstrom (22-187 in 1928)\n“There’s a lot more to come. It’s fun to watch him every day,” Reds manager David Bell said. “But it does starts with his approach and how he is working and trying to get better.”\nDe La Cruz has a major league-leading 57 steals and joined Hall of Famer Joe Morgan and Eric Davis as the only Reds with 20 homers and 50 stolen bases in a season. De La Cruz has four homers against Miami this year.\nSánchez drove a changeup from Jakob Junis into the right-center field upper deck in the sixth. The drive outdistanced a 478-foot homer by San Francisco’s Jorge Soler at San Francisco on July 21.\n“Sanchez has some of the best raw power in the game,” Marlins manager Skip Schumaker said. “He has the ability to hit the ball out of the ballpark, line to line.”\nTy France had three hits, including his first homer since he was acquired from Seattle on July 30, and Noelvi Marté also went deep for the Reds.\nMartinez, who had been pitching out of the bullpen, allowed four hits, struck out five and walked none in a 70-pitch in outing.\n“With my role being so versatile, there are unique ways to find opportunities,” Martinez said. “There are unique situations where I can help the team win late in the ball game and maintain my workload to be able to slide in like this and start.”\nMartinez said he had previously pitched on his birthday during his four seasons in Japan.\n“I also went five scoreless,” Martinez said.\nXavier Edwards singled twice for the Marlins, extending his on base games streak to 22.\nMuñoz gave up six runs — four earned — seven hits and three walks in 3 2/3 innings.\nTRAINER’S ROOM\nReds: INF Matt McClain (rib cage stress reaction) has not been scheduled for rehab games, Bell said.\nMarlins: C Nick Fortes left with quadriceps tightness after singling in the seventh inning.\nUP NEXT\nLHP Nick Lodolo (8-4, 3.99) will start the second game of the series for the Reds on Tuesday while the Marlins will go with RHP Max Meyer (2-1, 3.81).\n------\nAP MLB: https://apnews.com/hub/MLB\nCIN leads 1-0\nGame Information\n- Umpires:\n- Home Plate Umpire - Jim Wolf\n- First Base Umpire - Alan Porter\n- Second Base Umpire - Sean Barber\n- Third Base Umpire - Ryan Blakney",
        "date": "2024-08-06",
        "URL": "https://www.espn.com/mlb/recap/_/gameId/401570159"
      },
      {
        "title": "Elly De La Cruz Cincinnati Reds records home runs, stolen bases",
        "article": "Elly De La Cruz joins another exclusive Cincinnati Reds club\nJason Hoffman\nCincinnati Enquirer\nElly De La Cruz joined another exclusive Cincinnati Reds fraternity Monday night in Miami.\nThe Cincinnati phenom joined Eric Davis and Joe Morgan as the only Reds players with 20 home runs and 50 stolen bases in a season.\nDe La Cruz, in his first full season with the Reds, will need more time to tie either Davis or Morgan as \"Eric The Red\" and \"Little Joe\" accomplished the feat twice and thrice, respectively.",
        "date": "2024-08-05",
        "URL": "https://www.cincinnati.com/story/sports/mlb/reds/2024/08/05/elly-de-la-cruz-cincinnati-reds-records-home-runs-stolen-bases/74682412007/"
      },
      {
        "title": "Elly De La Cruz gives signed bat to fan who told him to hit home runs",
        "article": "Elly De La Cruz gives signed bat to young fan who told him twice to hit home runs\nDave Clark\nCincinnati Enquirer\nElly De La Cruz had quite a night in the Cincinnati Reds' 10-3 win Monday against the Marlins in Miami.\nDe La Cruz homered in the first inning and the eighth inning, and added two doubles.\nAnd the Reds tweeted that De La Cruz heard a young fan tell him to hit a home run before each of his blasts, his 19th and 20th of the season.\nDe La Cruz appeared to point toward the fan and smile after crossing home plate following the second homer.\nAutograph seekers watched as Elly gave that young fan a signed bat after the game. Video from the Reds via Twitter/X:\nLOVE SPORTS? [ Subscribe now for unlimited access to Cincinnati.com ]",
        "date": "2024-08-05",
        "URL": "https://www.cincinnati.com/story/sports/mlb/reds/2024/08/05/elly-de-la-cruz-gives-signed-bat-fan-who-said-hit-home-runs-cincinnati-reds-miami-marlins/74682781007/"
      },
      {
        "title": "Elly De La Cruz joins another exclusive Cincinnati Reds club - Yahoo Sports",
        "article": "Elly De La Cruz joins another exclusive Cincinnati Reds club\nElly De La Cruz joined another exclusive Cincinnati Reds fraternity Monday night in Miami.\nThe Cincinnati phenom joined Eric Davis and Joe Morgan as the only Reds players with 20 home runs and 50 stolen bases in a season.\nElly De La Cruz just became the third Cincinnati Red to hit 20 home runs and steal 50 bases in the same season, joining Eric Davis (twice) and Joe Morgan (three times).\n— Gordon Wittenmyer (@GDubMLB) August 6, 2024\nDe La Cruz, in his first full season with the Reds, will need more time to tie either Davis or Morgan as \"Eric The Red\" and \"Little Joe\" accomplished the feat twice and thrice, respectively.\nThis article originally appeared on Cincinnati Enquirer: Elly De La Cruz Cincinnati Reds records home runs, stolen bases",
        "date": "2024-08-05",
        "URL": "https://sports.yahoo.com/elly-la-cruz-joins-another-012310985.html"
      }
    ]
  },
  "2": {
    "id": 2,
    "Name": "Joe|Burrow",
    "Organization": "Cincinnati Bengals",
    "articles": [
      {
        "title": "Our Mission â\u0080\u0093 How News Works",
        "article": "Trustworthy and timely information empowers you to better understand your world and make educated decisions. Google aims to make it easier to stay informed by using technology to organize and help people access information about current issues and events. News experiences across Google are built to help you easily find news from a diversity of trusted sources so you can stay up-to-date and informed on the stories that matter most to you.\nWeâre committed to fostering a healthy and diverse news ecosystem because we know staying informed through access to quality, original reporting is vital to strong, functioning societies.",
        "date": null,
        "URL": "https://newsinitiative.withgoogle.com/hownewsworks/?fg=1"
      },
      {
        "title": "Cincinnati's Orlando Brown Jr. Reveals How Joe Burrow's Opened Up Entering This Seaso",
        "article": "Orlando Brown Jr. Reveals How Joe Burrow's Opened Up Entering This Season\nCINCINNATI âÂ Bengals quarterback Joe Burrow is opening up to his teammates more this training camp. Left tackle Orlando BrownÂ Brown dove into how with Kay Adams.\n\"How much more open he is with dialect or communication making a silly comment in a team meeting or something like that,\" Brown said. \"Being yourself and that's our leader. That's our captain, our El Chapo, whatever you want to call it. That's our guy.\"\nCincinnati is hoping forÂ a full, healthy season from Joe Burrow.\n\"He got a lot of time to think and you have a lot of time to yourself and with your loved ones I would imagine even more,\" Brown said about Burrow and his wrist recovery. \"So just I think man through time and and just understanding he's opened up even more.\"\nBrown is excited to keep protecting Burrow as he enters his second season with the quarterback.\nBookmark Bengals Talk for the latest news, exclusive interviews, film breakdownsÂ andÂ so muchÂ more!Â For more on the Bengals,Â subscribe to our YouTube Channel.\nYou May Also Like:\nWillie Anderson Offers Up Big Praise for Bengals Offensive Line Coach Frank Pollack\nPFF Names Bengals Cornerback as Rookie With Most to Gain This Training Camp\nJoe Burrow Ranked Lower Than Expected in NFL's Top 100\nLook: Young Bengals Fans Chant For Ja'Marr Chase as 'Hold-In' Continues\nJoe Burrow Highlights Young Receiver Development Without Ja'Marr Chase at Training Camp\nZac Taylor Sheds More Light on Joe Burrow's Practice Plan as Cincinnati Awaits Return of Ja'Marr Chase\nLook: Madden 25 Ratings Released For Bengals Wide Receivers And Safeties\nZac Taylor Notes Joe Burrow is Bigger Entering Training Camp: 'I Think It's a Good Thing'\nZac Taylor Dives Into Trent Brown Entering Training Camp on NFI: 'Just Trying to be Smart'\nBengals Wide Receiver Ja'Marr Chase Refuses to Say Patrick Mahomes' Name During NFL Top 100 Interview\nESPN Takes Bengals to Task For Not Extending Ja'Marr Chase: Mike Brown is 'Absolutely Robbing Him'\nFive Cincinnati Bengals Players Entering Training Camp on Roster Bubble\nLook: Trey Hendrickson Makes NFL 100 List for Fourth Consecutive Season\nUndisputed WWE Champion Cody Rhodes Has Message for Bengals QB Joe Burrow\nTim Krumrie on 2024 Bengals Ring of Honor Induction: Remember me as 'Mentally Toughest Guy Who Ever Played'\nNational Analyst Believes Joe Burrow Too High in Latest Quarterback Rankings\n-----\nBe sure to keep it locked on All Bengals all the time!\nSubscribe to the All Bengals YouTube channel\nFollow AllBengals on Twitter:Â @AllBengals\nSubscribe and follow the ONLY Daily Bengals Podcast",
        "date": "2024-08-04",
        "URL": "https://www.si.com/nfl/bengals/allbengals-insiders-plus/orlando-brown-jr-reveals-how-joe-burrow-s-opened-up-entering-this-season-01j4fgefr27r"
      },
      {
        "title": "Bengals News: Trent Brown explains how Joe Burrow has been opening up more - Cincy Jungle",
        "article": "Five Observations from Day 9 of Bengals Training Camp\n1. Right tackle Trent Brown was cleared to practice today but spent one more day on the rehab field (tossing a 50-pound bag among other things). Look for him to be in uniform and taking part in football activities tomorrow.\nBengals activate Trent Brown\nThe Bengals signed Brown as a free agent this offseason. He spent the last three seasons with the Patriots and also spent the 2018 season in New England before joining the Raiders for a couple of years.\nCincinnati Bengals make roster move, activate OT Trent Brown\nThe Cincinnati Bengals activated veteran offensive tackle Trent Brown on Sunday, clearing the way for his competition at right tackle with first-round rookie Amarius Mims.\nBengals training camp: A look at the team's depth chart after 2 weeks\nThe Cincinnati Bengals used all 10 of their picks in the 2024 NFL Draft, which has created a new wave of depth and more competitive roster battles than the Bengals have had over the last few years.Adding in some undrafted free agents who have developed in the Bengals’ system for multiple years, the Bengals have a stronger 90-man roster this summer.\nBengals rookie safety Anthony continues to impress, while vet Stone settling into role\nCINCINNATI (WKRC) - Bengals rookie safety Daijahn Anthony continued to impress in training camp with yet another interception in practice on Sunday in a backup role, while veteran free agent safety signee Geno Stone is settling nicely into his role with the starting unit.\nCincinnati Bengals training camp observations: Defense comes out with major energy on Day 9\nThe Cincinnati Bengals entered the weekend on the heels of quarterback Joe Burrow's most electric practice throwing the ball downfield. They now exit the weekend with the defense matching that energy.\nWatch Cincinnati Bengals Training Camp Highlights: Clips of Joe Burrow, Geno Stone\nCINCINNATI — The Bengals practiced again on Sunday afternoon, as fans poured into the Kettering Health Practice Fields to watch Joe Burrow and company get ready for the 2024 season.\nCincinnati's Orlando Brown Jr. Reveals How Joe Burrow's Opened Up Entering This Season\n\"How much more open he is with dialect or communication making a silly comment in a team meeting or something like that,\" Brown said. \"Being yourself and that's our leader. That's our captain, our El Chapo, whatever you want to call it. That's our guy.\"",
        "date": "2024-08-05",
        "URL": "https://www.cincyjungle.com/2024/8/5/24213476/bengals-news-trent-brown-joe-burrow-opening-up-more"
      },
      {
        "title": "Bengals QB Joe Burrow Touches on Mindset Against Chiefs: 'It's Always Exciting'",
        "article": "Joe Burrow Touches on Mindset Against Chiefs: 'It's Always Exciting'\nCINCINNATI âÂ Joe Burrow didn't get to play against Patrick Mahomes and the Chiefs last season, but that should change in an early 2024 matchup.\nBurrow dove into his mindset in the matchup on Up & Adams as a rare player to own a winning record in games against Mahomes (3-1).\n\"Not be scared to make mistakes,\" Burrow said about his mentality. \"You gotta go out and make plays because you know he's (Mahomes) gonnaÂ go out and make playsÂ andÂ that brings out the best in me. It's always an exciting challenge when we go against each other. It's an opportunity every time you go against himÂ too, because you know all the eyesÂ are going toÂ be on it.Â\n\"It's always exciting, we played each other so many timesÂ nowÂ you get to know the guys on defense. I don't know as many of the guys on offense because we're notÂ goingÂ against each other. But you know, guys like Chris (Jones). I know Travis (Kelce) because he's an Ohio guy. Clyde (Edwards-Helaire) is over there. So I know a lot of people. We've gone against each other so many times. And when you know each other, in and out like that. It always makes for a tough game, that's for sure.\"\nCincinnati takes on the Chiefs Sept. 15 at 4:25 p.m. ET.\nBookmark Bengals Talk for the latest news, exclusive interviews, film breakdownsÂ andÂ so muchÂ more!Â For more on the Bengals,Â subscribe to our YouTube Channel.\nYou May Also Like:\nBengals Comfortable With Plan for Offensive Tackle Trent Brown, Who Could Still Start at Right Tackle\nEvan McPherson Dives Into Contract Extension Talks Amidst Historic Kicker Extension\nBengals Right Tackle Trent Brown Discusses Competition With Amarius Mims\nZac Taylor Updates Bengals Injuries as Preseason Game Preparation Begins\nLook: Cincinnati Bengals Release First Depth Chart Ahead of Preseason Game Against Tampa Bay Buccaneers\nJoe Burrow Believes Production With Ja'Marr Chase Can Reach New Level\nCincinnati Bengals' Stars Not Worried About Ja'Marr Chase's Missed Practice Time\nCincinnati Bengals Rookie Amarius Mims Catching Attention and Advice in First NFL Training Camp\nWillie Anderson Offers Up Big Praise for Bengals Offensive Line Coach Frank Pollack\nPFF Names Bengals Cornerback as Rookie With Most to Gain This Training Camp\nJoe Burrow Ranked Lower Than Expected in NFL's Top 100\nLook: Young Bengals Fans Chant For Ja'Marr Chase as 'Hold-In' Continues\nJoe Burrow Highlights Young Receiver Development Without Ja'Marr Chase at Training Camp\nZac Taylor Sheds More Light on Joe Burrow's Practice Plan as Cincinnati Awaits Return of Ja'Marr Chase\nLook: Madden 25 Ratings Released For Bengals Wide Receivers And Safeties\nZac Taylor Notes Joe Burrow is Bigger Entering Training Camp: 'I Think It's a Good Thing'\nZac Taylor Dives Into Trent Brown Entering Training Camp on NFI: 'Just Trying to be Smart'\n-----\nBe sure to keep it locked on All Bengals all the time!\nSubscribe to the All Bengals YouTube channel\nFollow AllBengals on Twitter:Â @AllBengals\nSubscribe and follow the ONLY Daily Bengals Podcast",
        "date": "2024-08-06",
        "URL": "https://www.si.com/nfl/bengals/allbengals-insiders-plus/joe-burrow-touches-on-mindset-against-chiefs-it-s-always-exciting-01j4krfqrz5a"
      },
      {
        "title": "Joe Burrow says Patrick Mahomes “brings out the best in me” - Cincy Jungle",
        "article": "Joe Burrow recently joined Kay Adams for an interview.\nThe host of “Up and Adams” noted that the superstar QB for the Cincinnati Bengals has defeated Patrick Mahomes three out of four times he’s faced him. She then asked Burrow how facing the Kansas City Chiefs QB changes his approach to the game.\nHere is what Burrow said:\nI think you gotta go out and not be scared to make mistakes. You gotta go out and make plays, because you know he’s going to go out and make plays, and that brings out the best in me. It’s always an exciting challenge when we go against each other.\n.@Bengals QB Joe Burrow on his difference in approach when facing Patrick Mahomes and the #Chiefs...\n— Up & Adams (@UpAndAdamsShow) August 4, 2024\n\"Gotta NOT be scared to make mistakes... gotta go out and make plays cause you know he's gonna go out and make plays and that brings out the BEST in me.\"\nBurrow is 3-1 vs.… pic.twitter.com/w9L2T5UYuM\nAs Adams pointed out, we’ll get to see arguably the two best quarterbacks in the league face each other early this year, when the Bengals head to Kansas City to face the Chiefs in Week 2 of the season.\nAll camp, it has seemed that Burrow has been practicing with a chip on his shoulder, eager to remind outsiders of his place in the QB hierarchy. We recently discussed the fact that he feels a bit forgotten. Watch below:",
        "date": "2024-08-06",
        "URL": "https://www.cincyjungle.com/2024/8/6/24213972/joe-burrow-says-patrick-mahomes-brings-out-the-best-in-me"
      },
      {
        "title": "MSN",
        "article": null,
        "date": "2024-08-06",
        "URL": "https://www.msn.com/en-us/sports/nfl/skip-bayless-slams-joe-burrow-s-laughable-rank-on-top-100-list/ar-AA1ojwbo"
      },
      {
        "title": "Skip Bayless: Joe Burrow's NFL Top 100 ranking is 'most laughable'",
        "article": "Skip Bayless: Joe Burrow's NFL Top 100 ranking is 'most laughable'\nSports TV personality Skip Bayless tweeted Monday that his biggest issue with NFL.com's Top 100 players list was the ranking of Cincinnati Bengals quarterback Joe Burrow at No. 39.\nBayless tweeted it was the \"most laughable\" thing about the rankings.\n\"No, he hasn't been able to stay healthy, but when he is, he's a little better than (Patrick) Mahomes or Lamar (Jackson),\" Bayless added.\nBayless announced last week via Twitter/X that he had worked his final day on FS1's \"Undisputed,\" the show he used to co-host with Pro Football Hall of Famer Shannon Sharpe.\nAsked last week what he thought of his ranking, Burrow replied, \"I think I'm obviously better than that. But when you're not playing like - I didn't exactly have a season that would have put me any higher than that. So, you know, when you're hurt, you can't really complain much about any accolades or anything like that until you go out and prove yourself again.\"\nLOVE SPORTS? [ Subscribe now for unlimited access to Cincinnati.com ]",
        "date": "2024-08-05",
        "URL": "https://www.cincinnati.com/story/sports/nfl/bengals/2024/08/05/skip-bayless-joe-burrow-nfl-top-100-ranking-most-laughable-cincinnati-bengals/74683080007/"
      },
      {
        "title": "Joe Burrow reacts to shockingly low ranking on NFL Top 100 list",
        "article": "Joe Burrow reacts to shockingly low ranking on NFL Top 100 list\nIn a recent ranking of the NFL's Top 100 players, as voted on by the players themselves, Cincinnati Bengals star quarterback Joe Burrow came in at No. 39 overall behind other, less accomplished quarterbacks like Tua Tagovailoa and Jordan Love. The ranking is questionable, to say the least.\nListen, it's fair to have concerns about Burrow's ability to avoid injuries and stay out on the field, as he has suffered two season-ending injuries in his four seasons in the NFL.\nBut, when Burrow is healthy -- as he hopefully will be moving forward --he's arguably the second-best quarterback in the entire NFL behind Kansas City Chiefs signal-caller Patrick Mahomes and a proven playoff performer who has already led Cincinnati to a Super Bowl and two AFC championship games.\nTagovailoa, on the other hand, has a 0-1 career playoff record, while Jordan Love has one playoff victory to his name. Neither guy is better than Burrow, even considering the fact that he's coming off of a wrist surgery.\nBurrow shares his thoughts on the low ranking\nClearly, we're fired up about Burrow's low ranking on the list. But what about the man himself? The Bengals star QB recently shared his thoughts regarding his place on the Top 100 list, and he kept it pretty diplomatic, acknowledging that he needs to go out there and again prove how good he is in 2024.\nâI think Iâm obviously better than that,â Burrow said of the ranking. âBut when youâre not playing â¦ I didnât have exactly a season that would have put me any higher than that. When youâre hurt, you really canât complain much about any accolades or anything, until you go out and prove yourself again.â\nWhile the perceived slight might serve as a temporary motivator, Burrow doesn't need any external motivation to be at his best out on the field.\n\"Maybe it motivates you for a day,\" Burrow said. \"... I don't think you can continuously rely on that kind of motivation. You have to be intrinsically motivated to play at the level I want to play at and be as good as I want to be.\"\nBurrow is better than the 39th-best player in the NFL. We know that, and he knows that. But, he's taking the right approach to the ranking; not letting it get to him, while preparing to remind everyone just how good he is.",
        "date": "2024-08-05",
        "URL": "https://stripehype.com/posts/joe-burrow-reacts-to-shockingly-low-ranking-on-nfl-top-100-list-01j4dzhj8789"
      },
      {
        "title": "Three topics with Bengals OC Dan Pitcher: Joe Burrow’s progress, Ja’Marr Chase’s absence - The Athletic",
        "article": "CINCINNATI — Dan Pitcher had just completed his ninth training camp practice as offensive coordinator of the Bengals.\nThe 93-degree heat still stifling while players finished up work after practice, Pitcher was still in processing mode. He’d seen Joe Burrow drop a red zone dime to Trenton Irwin in the back corner for a touchdown. He again walked away impressed by the Cincinnati defensive communication making life hard on his group. And he had another batch of plays and developments to digest with his first regular-season game as coordinator now five weeks away.\nAdvertisement\nHe’s overseeing an offensive transition packed with new pieces, tinkering with change and littered with potential.\nI caught up with him through drops of sweat beads to touch on his view of how critical topics of the offense’s development are unfolding over two weeks.\nTopic 1: Gauging Joe Burrow’s performance\nBackground: Burrow is returning from wrist surgery, participated in OTAs and only taken two proactive limited practices through the first two weeks of this camp. He’s yet to throw an interception in 11-on-11 (only one in seven-on-seven) uncorked his most impressive ball of training camp this past weekend, hitting Shedrick Jackson 50 yards down the field while on the run outside the pocket.\nHow does he view his progress and comfort compared to the expectations? What have been the most encouraging elements?\nPitcher: “He’s been good overall. It was obviously nice to see him uncork a couple of those long ones on the run the other day. I think you’ve seen all the deep range that he needs. I think the accuracy has been there. He’s continuing to get that timing down a little bit, if there’s anything that’s popped up here and there, it might just be getting that part all the way back to certain guys. But he looks like he’s gonna be able do everything we need him to do to win a whole lot of football games.”\nGO DEEPER\nAmarius Mims becoming the biggest story in Bengals camp\nTiming with new targets will be a story every August. Most plays in camp Burrow drops back to see some combination of three second-year players who didn’t start last season (WR Andrei Iosivas, WR Charlie Jones, RB Chase Brown), a new tight end (Mike Gesicki) and running back (Zack Moss). Timing being a regular issue is merely part of the process this time of year?\nPitcher: “We got new guys, many of whom are showing some really good things, but it’s about learning body language and learning just how fast a certain guy is out of this break versus this guy. You know, this guy likes to turn in versus this look, this guy turns out. We afford our skill players — at least the ones that have proven that they deserve it — we afford them some license to do things that make sense and it’s really just that this time of year is about us figuring out what those are and making sure we’re on the same page.”\nTopic 2: What is going to happen in the tight end room?\nBackground: Drew Sample and Tanner Hudson return from last season, but Gesicki along with draft picks Erick All, Tanner McLachlan and undrafted free-agent Cam Grandy all make for a packed battle for playing time and roster spots. Plus, Gesicki and Hudson are primarily receiving threats and open up a new set of possibilities for usage of the position in the Bengals’ offense.\nAdvertisement\nHow much do you know what’s going on in the tight end room and how much of what’s happening is tinkering with possibilities?\nPitcher: “I think there’s a lot of exploration still going on. It’s obviously nice to see Erick out there as he works his way back. That’s been exciting because I think he’s got some really high-end ability once he’s able to put it all together and he’s a long way out, but he’s given us all the indication that he’s gonna get there eventually.\nFree, daily NFL updates direct to your inbox.\nFree, daily NFL updates direct to your inbox.\n“It’s just a pleasure when Drew, Tanner and Mike are just, they all think the game like a quarterback. And so that’s really fun because they come back and you can give them a coaching point and they know exactly what you’re talking about and you can just see it in their eyes like, ‘Oh, yeah, yeah, I got you.’ So it’s, it’s a fun room, I think obviously however the workload ends up being divvied up that has not yet been decided, but we feel good about those guys.”\nGesicki, in particular, hasn’t been as noticeable in 11-on-11 (also day to day with tightness, according to Zac Taylor) and still working in the aforementioned timing development aspect. How much is his involvement about building his comfort with creativity and connecting with Burrow?\nPitcher: “Mike’s an example of a guy who, he’s been around a long time who deserves that trust. You know, because with that license comes responsibility that you’re gonna do it when the defense dictates, you should do it and not at other times when you should just run the route like it’s run on the paper. And that takes awareness so Mike’s one of those guys for sure that has that respect from us and should be allowed some creativity from time to time.”\nTopic 3: How do you implement new packages for Ja’Marr Chase without him practicing?\nAmid contract-extension discussions, Chase has yet to participate in any of the 10 Cincinnati practices or the offseason program. Pitcher has said there are new wrinkles he’s implemented in the scheme, and as you would expect, many involve new ways to amplify the Bengals’ star receiver.\nHow do you approach any new usage of Chase without him practicing? Is it just film work, running it with other players, talking to him about it?\nGO DEEPER\nBengals trend report: Highlighting who positioned themselves best as pads come on\nPitcher: “I would say we’re still doing a good job of really conceptually practicing all the things that we planned to practice from a scheme standpoint. Then I think you just, when you do have Ja’Marr available to you, you just may amend things, formation and motion-wise to get him into some of the spots that are the primary reasons and these concepts that we’ve been working on.”\nAdvertisement\nIt’s not like there is a new offense to learn or any concern about chemistry with the quarterback, so I imagine that makes it fairly easy?\nPitcher: “Again, we haven’t revolutionized our offense. We’ve added some wrinkles and we’re working on those right now. At the end of the day, it’s all gonna be about putting our guys in a position to have success. Ja’Marr is front and center in that. He’ll get the work once we get him and we’ll move on from there.”\n(Top photo of Joe Burrow: Albert Cesare / The Enquirer / USA Today)",
        "date": "2024-08-06",
        "URL": "https://www.nytimes.com/athletic/5681908/2024/08/06/bengals-oc-dan-pitcher-joe-burrow-jamarr-chase/"
      },
      {
        "title": "Justin Fields Takes Starting Reps for Steelers With Russell Wilson Out | Around the AFC North",
        "article": "Pittsburgh Steelers: Justin Fields Shines While Russell Wilson Is Hampered\nJustin Fields is having the kind of start to training camp he wanted, while Russell Wilson is not.\nFields has been taking first-team reps for the Steelers since Russell Wilson suffered a calf injury on the first day of camp. Wilson has been at camp, but the Steelers have been cautious with his workload so far.\nThere has been no indication from Head Coach Mike Tomlin that Wilson won't be the starting quarterback Week 1. However, Fields has played well according to new Offensive Coordinator Arthur Smith, who is intrigued by Fields' dual threat as a runner and thrower.\n\"He's a dangerous football player with the ball in his hands,\" Smith said via Gerry Dulac of the Pittsburgh Post-Gazette. \"It allows you to get creative. Maybe you change up a little bit of a defensive game plan for him. Certainly, he adds a different element.\"\nSmith has challenged Fields to take shots downfield and avoid settling for safe throws. George Pickens and Van Jefferson have made several deep connections with Fields during practices.\n\"Sometimes we're asking him to be aggressive, even in 7-on-7. You have to try to in practice,\" Smith said. \"Nobody wants to see negative plays or if he just checks down. We got to see what he can really do and what he can see in the pocket and all that stuff. Him having more reps is accelerating that process.\"\nCincinnati Bengals: Joe Burrow Looks 'Really Good' in Bengals' Camp\nJoe Burrow is also benefiting greatly from getting reps in camp.\nWhen Burrow entered the league in 2020, the Bengals' training camp wasn't normal due to the COVID-19 pandemic. In 2021, Burrow began training camp still recovering from a season-ending torn ACL. In 2022, he had appendicitis in camp that interfered with his preparation, and last year Burrow injured his right calf on the second day of camp.\nThis has been Burrow's first \"normal\" training camp, and Head Coach Zac Taylor thinks that's important, even for a quarterback of Burrow's caliber.\n\"He did not practice a day in August last year,\" Taylor said via Dan Graziano of ESPN. \"He practiced two days in July, and then he came back the game week of Cleveland. That was his first real practice. So to be able to get however many practices we're getting in August is just such a game-changer in terms of the comfort of moving in the pocket and the chemistry with the receivers and seeing these coverages and communication. It's just night and day when you're standing in the back talking it through with guys versus actually doing it. The comfort level is on a whole different level.\"\nTaylor said Burrow looked fully recovered from last year's season-ending injury to his throwing wrist. However, they'll be some off days planned for Burrow to be safe.\n\"He looks really good,\" Taylor said. \"He looks like the guy that I know. Now it's just my job to manage him early in camp, even when he says, 'I feel great, I want to go.'\"\nCleveland Browns: Jerry Jeudy Finding Quick Chemistry With Deshaun Watson\nWide receiver Jeudy missed mandatory minicamp in June and the first few days of training camp with an undisclosed injury. However, since returning to practice, Jeudy has been a consistent target for quarterback Deshaun Watson and the two have established quick chemistry.\n\"Deshaun throw a nice ball,\" Jeudy said via Chris Easterling of the Akron Beacon Journal. \"I've been watching Deshaun since he was in college, he always threw a nice ball. I'm excited to see what we do this year.\"\nThe Browns traded fifth and sixth-round draft picks to the Denver Broncos in March to acquire Jeudy to join Amari Cooper and Elijah Moore in their wide receiver rotation. Jeudy was the 15th overall pick in the 2020, but he never cracked 1,000 yards during his four seasons in Denver playing with six different starting quarterbacks.\nJeudy's best season in Denver came in 2022 (67 catches, 972 yards, six touchdowns) and he's only 25 years old. Head Coach Kevin Stefanski believes Jeudy's best seasons are ahead.\n\"Jerry's been a really fun addition to this group,\" Stefanski said. \"I think he does an outstanding job in the meeting room, on the practice field, has a great attitude, works very hard. Obviously, we're excited to get him back out there and full speed and working with his teammates, but he fits in with us how we operate. We're excited to have him.\"",
        "date": "2024-08-05",
        "URL": "https://www.baltimoreravens.com/news/justin-fields-starting-reps-russell-wilson-joe-burrow-jerry-jeudy-around-afc-north"
      },
      {
        "title": "Wild Joe Burrow, Caleb Williams prop bets for 2024 NFL season",
        "article": "In some of the most bizarre betting props you will ever see, FanDuel Sportsbook Canada is allowing customers to wager on Caleb Williams’ fingernails and Joe Burrow’s hair.\nMuch has been made of Williams’ choice to don nail polish, with the No. 1 pick often wearing pink finger polish, among other colors.\nFanDuel thinks it’s nearly a forgone conclusion that the league’s No. 1 pick in the 2024 NFL Draft will indeed have painted nails to start his NFL career, placing -265 odds on his nails to be painted in Week 1.\nThose -265 odds imply a 72.6 percent chance it will happen against the Titans.\nWilliams has had a dicey relationship with fans who have criticized his decision to paint his nails, telling the USC director of player relations that his “Nails are clear,” but his “lips are pink. Your girl love ’em.”\nThe quarterback has been painting his nails since he came into the public eye at Oklahoma and then eventually at USC, where he followed Lincoln Riley.\nCaleb Williams painted nails in Week 1?\nFanDuel is also offering props on Burrow’s hair, which he debuted at the beginning of training camp but had done before in high school, when he began making his best “Slim Shady” impression.\nIf you think that Burrow will rock the bleached blonde hair similar to Eminem’s infamous hairdo when the Bengals face the Patriots, FanDuel will pay you $1.14 for your $1 bet.\nJoe Burrow bleach blonde hair in Week 1?\nBetting on the NFL?\n- Read our expert guide on how to bet on the NFL\n- Check out the best NFL betting sites\n- Get the latest Super Bowl 2023 Odds.\n- Get the BetMGM Bonus Code\nIt’s a bizarre new trend for the two stud quarterbacks who are bringing out their brightest and oddest fashion statements to the NFL.",
        "date": "2024-08-05",
        "URL": "https://nypost.com/2024/08/05/sports/wild-joe-burrow-caleb-williams-prop-bets-for-2024-nfl-season/"
      },
      {
        "title": "Joe Burrow shares unique reason why he chose to learn piano this offseason - On3",
        "article": "Joe Burrow shares unique reason why he chose to learn piano this offseason\nJoe Burrow has gotten a lot of attention for changing his hairstyle, but one of the more interesting things he did in the offseason was learn how to play the piano. When speaking to reporters last week, the star Cincinnati Bengals quarterback explained why playing the piano during the offseason was good for him.\n“I’ve always wanted to learn. I thought it helped my dexterity, coming back from injury,” Burrow said. “So I thought it was a good time to learn.”\nA reporter then asked Burrow what kind of songs he knew how to play on the piano. “I got three songs that I think I can play right now pretty confidently,” the former LSU Tigers quarterback revealed. “So we’re still working on that.”\nBurrow is working his way back to the field after missing the final seven games of the season due to a wrist injury. In the early stages of training camp, Burrow revealed that his wrist was fine and he could make all the necessary throws.\n“I still have some throws, ‘Well, what did that look like?’ Usually, it goes where I want it to, but sometimes it doesn’t spin the way I want it to, so we’re still working through that,” Burrow said. “But I feel really good about where I’m at. I feel like I kind of figured something out towards the end of the practice there in individuals. I’m looking forward to exploring that more.”\nJoe Burrow looking to get some work in during the preseason\nIn the last two preseasons, Burrow has dealt with injuries, preventing him from getting any work done during that time. And with the Bengals starting the season 0-2 in both years, the plan for Burrow is to see limited action during the preseason.\n“It’s just different when you go warm up knowing you’re going to play,” Burrow said. “I think that’s the best way to go about it. This year we’ll try it out. I think in order for us to be at our best at the beginning of the year, I think we kind of need that. That’s something we wanted to do in years past and we haven’t been able to do. I’m excited to get that done this year.\n“We’ll see (if it prevents a slow start). That’s a question that’s to be determined. I think we’re thinking about it the right way. I think we’re trying new things to try to help those slow starts and getting off to faster starts, putting us in a better position at the midway point of the season. I do think that it will help, but we’ll see.”",
        "date": "2024-08-05",
        "URL": "https://www.on3.com/pro/news/joe-burrow-shares-unique-reason-why-he-chose-to-learn-piano-this-offseason/"
      }
    ]
  },
  "3": {
    "id": 3,
    "Name": "Ja'Marr\nMatt|Chase\nMiazga",
    "Organization": "Cincinnati Bengals",
    "articles": [
      {
        "title": "Our Mission â\u0080\u0093 How News Works",
        "article": "Trustworthy and timely information empowers you to better understand your world and make educated decisions. Google aims to make it easier to stay informed by using technology to organize and help people access information about current issues and events. News experiences across Google are built to help you easily find news from a diversity of trusted sources so you can stay up-to-date and informed on the stories that matter most to you.\nWeâre committed to fostering a healthy and diverse news ecosystem because we know staying informed through access to quality, original reporting is vital to strong, functioning societies.",
        "date": null,
        "URL": "https://newsinitiative.withgoogle.com/hownewsworks/?fg=1"
      },
      {
        "title": "FAILED",
        "article": "FAILED",
        "date": "FAILED",
        "URL": "https://www.bizjournals.com/cincinnati/inno/stories/news/2024/07/30/forbes-30-under-30-joe-burrow-chase-elly-de-cruz.html"
      },
      {
        "title": "Bengals stars, startup founders headline 'Forbes' 30 Under 30 list",
        "article": "CINCINNATI (Cincinnati Business Courier) - The Forbes 30 Under 30 Cincinnati list includes sporting superstars, startup founders, local artists and more.\nForbes unveiled the list in partnership with JobsOhio during an event July 30 at the Banks’ Anderson Pavilion.\nJumping from the gridiron (pitch, field, etc.) to the Under 30 list are Cincinnati Reds shortstop Elly De La Cruz; Cincinnati Bengals quarterback Joe Burrow and wide receiver Ja’Marr Chase; and FC Cincinnati defenders Matt Miazga and Miles Robinson.\nRead the full story from the Cincinnati Business Courier.\nCincinnati Business Courier is a Local 12 News partner",
        "date": "2024-07-30",
        "URL": "https://local12.com/news/local/bengals-stars-startup-founders-headline-forbes-cincinnati-30-under-30-list-joe-burrow-elly-de-la-cruz-edlc-reds-jamarr-chase-matt-miazga-miles-robinson"
      },
      {
        "title": "Forbes names Under 30 list for Cincinnati",
        "article": "Forbes unveils Under 30 list for Cincinnati\nForbes Magazine on Tuesday announced a first-ever Under 30 Cincinnati list, spotlighting young entrepreneurs, sports figures and other emerging talent, including Joe Burrow and Elly De La Cruz.\nThe new list comes as Cincinnati prepares to host 2024 Forbes Under 30 Summit in September presented by JobsOhio. Cincinnati joins 10 other North American cities or regions that inspired inaugural local lists by Forbes last year: Atlanta, Austin, Boston, Chicago, Cleveland, Los Angeles, Miami, Puerto Rico, Seattle and Toronto.\nIn producing its lists, Forbes said it accept online submissions nominated by peers or self-nominated before magazine staffers and outside experts evaluate nominees on multiple factors, including business metrics, social impact, inventiveness and potential. Forbes next list for the 2025 Under 30 North America will be unveiled in December.\nThe Forbes Under 30 Local Cincinnati are:\n- Elly De La Cruz, shortstop for the Cincinnati Reds\n- Joe Burrow, quarterback for the Cincinnati Bengals\n- Ja'Marr Chase, wide receiver for the Cincinnati Bengals\n- Matt Miazga, defender for FC Cincinnati\n- Miles Robinson, defender for FC Cincinnati\n- Caroline Blackburn, senior manager of digital strategy for the Cincinnati Bengals\n- Emil Barr, founder of Step Up Social\n- Eliana Batsakis, founder of Eliana Batsakis\n- David Wysong, trending news editor for The Enquirer\n- Emilee Chinn, photographer for the Cincinnati Reds\n- Laura Castillo, director of the City of Cincinnati Department of Economic Inclusion\n- Hannah Sagel, brand director at Procter & Gamble\n- Chase Crawford, founder of Four by Three\n- Ben Baumeister, senior director of event strategy at the Cincinnati Open\n- Michael Thompson, founder of Michael Thompson Studios\n- Matine Yuksel, co-founder of Beltways\n- Gus Ricksecker, chief of staff for Cincinnati council member Reggie Harris\n- Romain Mayambi, photographer\n- Chelsea Hindman, co-founder of Willow Boutique\n- Anu Vora, founder of Mindfully Behavioral Health\n- Jaeydah Edwards, senior program director of Groundwork Ohio River Valley\n- Benny Russert, director of Vitis Technologies\n- Connor Paton, co-founder of Noshable\n- Evan Fix, co-founder of Noshable\n- Macallan Hoeweler, co-founder of Noshable\n- Isaac Hamlin, founder of Better Blend\n- Kayla Braden, co-founder of Peachy and Vintage\n- Caden Adams, co-founder of Peachy and Vintage\n- Sam Heareth, owner of Greenhouse Cafe\n- Taylor Berling, founder of Inner Vision Pilates\n- Molly Rizkallah, CEO of Cincy Carbon\n- Zachary Beller, co-founder of Vixiv\n- Aaron Chow, co-founder of Vixiv\n- Chantal Phillip, creator",
        "date": "2024-07-30",
        "URL": "https://www.cincinnati.com/story/money/2024/07/30/forbes-names-under-30-list-for-cincinnati/74546581007/"
      },
      {
        "title": "Joe Danneman",
        "article": "Joe Danneman\nFOX19 NOW Sports Director\nCincinnati\nJoe Danneman joined the FOX19 NOW news team as a sports anchor/reporter in April 2011.\nHe actually started his career at FOX19 NOW in 2001 after he graduated from Syracuse University, starting as a news writer. Joe worked his way up at the station to news producer, sports producer and, eventually, sports/news reporter starting in 2004.\nJoe left for more anchoring experience in 2009 and worked as the sports director at WFIE-TV in Evansville. Where, in addition to anchoring and reporting, he also got his first professional experience calling live sporting events.\nSome of his career highlights include covering Super Bowl XLIV, two national championship college football games, NCAA DII College World Series, Major League Baseball's opening day, NFL playoffs, several NCAA tournament games and dozens of state championship high school games in Ohio, Kentucky and Indiana.\nThe Cincinnati area is Joe’s hometown. He grew up across the river in Northern Kentucky and graduated from Covington Catholic High School. When not at the office, he’s dad. Joe and Lynsey are the lucky parents of three little boys, Luke, Jack and Andrew.\nJoe is honored to be part of your neighborhood and can’t wait to interview you or someone you know. Email him at jdanneman@fox19.com.",
        "date": "2024-05-29",
        "URL": "https://www.fox19.com/authors/Joe_Danneman/"
      }
    ]
  }
}